//-------------------------------------------------------------------------修改分割线--------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------

//这里主要是对操作流熟悉,实现流之间的交互表达

#include <iostream>
#include <stdexcept>
using namespace std;

istream &f(istream &in){
	int v;
	while(in >> v, !in.eof()){
		if(in.bad())
			throw runtime_error("IO错误");
		if(in.fail())
			cerr << "数据错误,请重试:" << endl;
			in.clear();
			in.ignore(100, '\n');
			continue;
	}
	cout << v << endl;
	return in;
}

int main()
{
	cout << "请输入一些数,按Ctrl+Z结束" << endl;
	f(cin);
	return 0;
}
