//---------------------------------------------------------------------修改分割线------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------

//---这里主要的问题是在于C++中数的溢出环绕行为给程序带来的破坏影响,这里我们主要是为了验证这些猜想.
//1.判断C++一个整数的溢出是否会造成环绕行为

#include <iostream>

using namespace std;

void function(){

}

int main()
{
	unsigned int i = 0;
	cout << "i" << " : " << i << endl;
	
	i = ~i;
	cout << "i" << " : " << i << endl;
	
	//先将数值设为无符号的数最大,然后对于数值进行累加,发现数值超过阈值进行回环
	unsigned int a = i + 3;
	cout << "a" << " : " << a << endl;
}
